const resumeList = [
  {
    title: '第伍区 （2018.9-2019.3)',
    tips: [
      '职责: 区块链公司，主要负责各类活动页实现，以及分销渠道管理，财务管理，管理员管理，期权交易等。',
      '离职原因: 由于国家不支持区块链发展，因此公司由于业务调整，裁掉半数人员。'
    ],
    detailText: [
      {
        menuText: '销渠道管理',
        taskText:
          '独立负责前端分销渠道实现，使用GraphQL去进行请求（可减少http请求，方便扩展，类型检查），用CI自动部署，更注意一些代码开发细节以及如何更好的去进行项目发布。'
      }
    ]
  },
  {
    title: '新东方在线 （2016.11-2018.8）',
    tips: [
      '职责: 负责前端团队技术建设和整体前端框架的规范，及公司儿童部产品线的交互设计和前端开发',
      '离职原因: 因为对象在杭州，辞掉了前端负责人的岗位，来杭州工作'
    ],
    detailText: [
      {
        menuText: '新东方|自然拼读英文夏令营小程序',
        taskText:
          '带领3人团队成功在短短的一个月的开发周期里面上线小程序，通过实现分享好友，好友帮赞解锁，canvas绘制专属动态海报图携带小程序码分享，录音，测评，答题，埋点数据统计分析，分享打卡的等功能模块的实现，迅速的开发上线发布，吸引了一大批奶爸虎妈的来使用，快速的配合了运营的推广和网站的引流。'
      },
      {
        menuText: '多纳微信课后台管理 以及 h5自然拼读(微信公众号开发)',
        taskText:
          '项目开发团队方案的制定，优化，检测上线，跟进需求等，项目采用vue + vuex + router + iview + axios +webpack +echarts+validate 等技术实现，项目最大收获，对 整个项目进行了较好的模块化管理，组件复用，更高效的去部署开发环境生产环境。公众号里根据后台管理系统配置的，自动生成链接，匹配上传的资源，不同阶级的教学资源，极大方便运营的操作。'
      },
      {
        menuText: '多纳绘本后台管理',
        taskText:
          '独立负责这次后台横版竖版绘本的统一管理，创建绘本图书分类，添加图书，上传图书图片，音频，文字描述等等功能的实现。对iviewUI框架进行了运用，大大提高了开发ui组件对项目的开发效率。'
      },
      {
        menuText: '多纳英语水平测试',
        taskText:
          '运用echart生成雷达图来描述每一个宝贝的学习情况，实现多个录音，上传多个音频，css3动画运用，js扩展插件的形式去实现大部分相同功能(选择答案后3s跳转下一道题以及5s未作答选项闪烁效果等)，以及不同题型的功能(根据html的单词设置打乱单词展示顺序)等技术的实现满足了项目的开发需求。'
      }
    ]
  },
  {
    title: '北京三石科技有限公司（2016.4-2016.10）',
    // tips: ['职责:负责静态页面编写', '离职原因:学不到东西']
    detailText: [
      {
        menuText: '打车后台管理',
        taskText:
          '使用前后端分离的方式，负责打车后台管理页面的功能实现(权限管理，城市管理，根据谷歌API获取城市地理位置信息，设置城市坐标以及范围等，订单管 理等功能)。打车app 分享 个人信息以及详情页的h5页面实现。适配各种设备。(主要有些比较复杂的数据交互，例 如获取数据再 canvas 画图等)'
      }
    ]
  },
  {
    title: '北京旺年科技发展有限公司（2013.11-2015.12）',
    // tips: ['职责:负责静态页面编写', '离职原因:学不到东西']
    detailText: [
      {
        menuText: '各类前端页面',
        taskText:
          '负责项目整体页面的把控以及页面实现。 各种响应式自适应页面的实现。 页面优化兼容性调整等。各种手机端页面实现，微官网，场景应用等等。 负责公司的部分设计，前台制作，以及跟后台配合'
      }
    ]
  }
]
export { resumeList }
